<a href="https://colab.research.google.com/github/Void-Brain70/Machine_Learning/blob/main/Naive_Bayes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("/content/titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [7]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [8]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [9]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [11]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [12]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [13]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [15]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [18]:
model.score(X_test,y_test)

0.7686567164179104

In [19]:
X_test[0:10]

     Pclass   Age      Fare  female
677       3  18.0    9.8417       1
124       1  54.0   77.2875       0
877       3  19.0    7.8958       0
799       3  30.0   24.1500       1
4         3  35.0    8.0500       0
261       3   3.0   31.3875       0
452       1  30.0   27.7500       0
251       3  29.0   10.4625       1
498       1  25.0  151.5500       1
742       1  21.0  262.3750       1

In [20]:
y_test[0:10]

677    1
124    0
877    0
799    0
4      0
261    1
452    0
251    0
498    0
742    1
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[0:10])

array([1, 1, 0, 1, 0, 0, 0, 1, 1, 1])

In [22]:
model.predict_proba(X_test[:10])

array([[4.44184971e-01, 5.55815029e-01],
       [3.45497790e-01, 6.54502210e-01],
       [9.66562484e-01, 3.34375156e-02],
       [4.50031440e-01, 5.49968560e-01],
       [9.68982214e-01, 3.10177855e-02],
       [9.56582635e-01, 4.34173649e-02],
       [7.25832288e-01, 2.74167712e-01],
       [4.60315848e-01, 5.39684152e-01],
       [2.57522207e-05, 9.99974248e-01],
       [3.79653109e-13, 1.00000000e+00]])

In [23]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.792     , 0.808     , 0.736     , 0.79032258, 0.79032258])